
require "login"

mSleep(5000);

--[[
1000:登录
1001:账号切换
3001:朋友圈发文
3002:朋友圈小视频发布
3003:朋友圈分享链接
3004:朋友圈点赞
3005:朋友圈评论
4000:搜索加好友
4001:通讯录加好友
4002:搜索加公众号
4003:附近的人打招呼
4004:漂流瓶
5000:好友群发消息
5001:好友群发图片
5002:好友逐个发消息（清僵尸粉）
5003:好友逐个发图片（清僵尸粉）
5004:好友逐个发小视频
5005:好友逐个发收藏
6000:微信群里发消息
6001:微信群里发小视频
6002:微信群里发名片
6003:微信群里发图片
6004:微信群里发收藏
6005:微信群里发红包
]]--


action = readPasteboard();  --读出剪贴板内容
--mSleep(3000);                --延迟 3 秒


if ("1000" == action) then
	toast("1");
	login.login();
elseif("1001" == action) then
	toast("2");
elseif("3001" == action) then

else
	toast("false");
end;
